# **Importing**

**Importing Libraries & Datasets**

In [1]:
#Importing Libraries

import pandas as pd
import numpy as np
from sklearn import metrics
from matplotlib import rcParams
rcParams['figure.figsize'] = (12,  6)
import matplotlib.pyplot as plt

import seaborn as sns
import warnings
warnings.filterwarnings("ignore")

In [2]:
## Importing Datasets

lon_lat = pd.read_csv("C:/Users/GULAFSHAN/Desktop/Data_Analytics_Proj/Longitude_Latitude.csv")
marine = pd.read_csv("C:/Users/GULAFSHAN/Desktop/Data_Analytics_Proj/Global_2020_MarineSpeciesRichness_AquaMaps.csv")
temp = pd.read_csv("C:/Users/GULAFSHAN/Desktop/Data_Analytics_Proj/city_temp.csv")

In [3]:
## Displaying Datasets

display(lon_lat.head())
display(marine.head())
display(temp.head())

   Unnamed: 0 country   latitude  longitude                  name
0           0      AD  42.546245   1.601554               Andorra
1           1      AE  23.424076  53.847818  United Arab Emirates
2           2      AF  33.939110  67.709953           Afghanistan
3           3      AG  17.060816 -61.796428   Antigua and Barbuda
4           4      AI  18.220554 -63.068615              Anguilla

  C-Square Code  Latitude  Longitude  Species Count
0    1212:121:2     22.25     121.75           9887
1    1212:121:4     22.75     121.75           9874
2    1212:354:4     25.75     124.75           9772
3    1212:353:4     25.75     123.75           9701
4    1012:236:4      3.75     126.75           9687

   Region  Country State     City  Month  Day  Year  AvgTemperature
0  Africa  Algeria   NaN  Algiers      1    1  1995            64.2
1  Africa  Algeria   NaN  Algiers      1    2  1995            49.4
2  Africa  Algeria   NaN  Algiers      1    3  1995            48.8
3  Africa  Algeria   NaN  Algiers      1    4  1995            46.4
4  Africa  Algeria   NaN  Algiers      1    5  1995            47.9

# **Data Cleaning/ Preparation**

In [4]:
#Dropping unnamed column
print("-"*50)
print("           After Dropping Unnamed Column")
print("_"*50)
lon_lat = lon_lat.drop(lon_lat.columns[[0]], axis=1) 
display(lon_lat.head())

--------------------------------------------------
           After Dropping Unnamed Column
__________________________________________________

  country   latitude  longitude                  name
0      AD  42.546245   1.601554               Andorra
1      AE  23.424076  53.847818  United Arab Emirates
2      AF  33.939110  67.709953           Afghanistan
3      AG  17.060816 -61.796428   Antigua and Barbuda
4      AI  18.220554 -63.068615              Anguilla

In [5]:
# Shape of the dataset
print("-"*75)
print("Shape of Longitude & Latitude Dataset   : ",lon_lat.shape)
print("Shape of Marine Species Richness Dataset: ",marine.shape)
print("Shape of City Temperature Dataset       : ",temp.shape)
print("_"*75)

---------------------------------------------------------------------------
Shape of Longitude & Latitude Dataset   :  (245, 4)
Shape of Marine Species Richness Dataset:  (174321, 4)
Shape of City Temperature Dataset       :  (2906327, 8)
___________________________________________________________________________

In [6]:
# Description Of The Datasets

print("-"*40)
print("       Longitude & Latitude")
print("_"*40)
display(lon_lat.describe())
print("-"*40)
print("         Marine Species Richness")
print("_"*40)
display(marine.describe())
print("-"*57)
print("                  City Temperature ")
print("_"*57)
display(temp.describe())

----------------------------------------
       Longitude & Latitude
________________________________________

         latitude   longitude
count  244.000000  244.000000
mean    16.253109   13.294814
std     27.031206   73.976477
min    -75.250973 -177.156097
25%     -0.301710  -38.092008
50%     16.869235   18.182149
75%     38.965238   49.046734
max     77.553604  179.414413

----------------------------------------
         Marine Species Richness
________________________________________

            Latitude      Longitude  Species Count
count  174321.000000  174321.000000  174321.000000
mean       -0.496855      -8.443958     487.978563
std        47.551624     109.834499     982.532298
min       -78.250000    -179.750000       1.000000
25%       -42.250000    -107.250000     104.000000
50%        -5.250000     -18.750000     325.000000
75%        36.750000      89.250000     472.000000
max        89.750000     179.750000    9887.000000

---------------------------------------------------------
                  City Temperature
_________________________________________________________

              Month           Day          Year  AvgTemperature
count  2.906327e+06  2.906327e+06  2.906327e+06    2.906327e+06
mean   6.469163e+00  1.571682e+01  2.006624e+03    5.600492e+01
std    3.456489e+00  8.800534e+00  2.338226e+01    3.212359e+01
min    1.000000e+00  0.000000e+00  2.000000e+02   -9.900000e+01
25%    3.000000e+00  8.000000e+00  2.001000e+03    4.580000e+01
50%    6.000000e+00  1.600000e+01  2.007000e+03    6.250000e+01
75%    9.000000e+00  2.300000e+01  2.013000e+03    7.550000e+01
max    1.200000e+01  3.100000e+01  2.020000e+03    1.100000e+02

**Identifying Anomalies/ Missing Data**

In [7]:
# Information about the dataset

display(lon_lat.info())
print("-"*50)
display(marine.info())
print("-"*50)
display(temp.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    244 non-null    object
 1   latitude   244 non-null    float64
 2   longitude  244 non-null    float64
 3   name       245 non-null    object
dtypes: float64(2), object(2)
memory usage: 7.8+ KB

None

--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 174321 entries, 0 to 174320
Data columns (total 4 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   C-Square Code  174321 non-null  object
 1   Latitude       174321 non-null  float64
 2   Longitude      174321 non-null  float64
 3   Species Count  174321 non-null  int64
dtypes: float64(2), int64(1), object(1)
memory usage: 5.3+ MB

None

--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2906327 entries, 0 to 2906326
Data columns (total 8 columns):
 #   Column          Dtype
---  ------          -----
 0   Region          object
 1   Country         object
 2   State           object
 3   City            object
 4   Month           int64
 5   Day             int64
 6   Year            int64
 7   AvgTemperature  float64
dtypes: float64(1), int64(3), object(4)
memory usage: 177.4+ MB

None

In [8]:
## Checking Null Values
display(lon_lat.isnull().sum())
print("-"*50)
display(marine.isnull().sum())
print("-"*50)
display(temp.isnull().sum())


## Handling NAN Values filling missing values using fillna() 
lon_lat = lon_lat.fillna(0)
marine = marine.fillna(0)
temp = temp.fillna(0)

country      1
latitude     1
longitude    1
name         0
dtype: int64

--------------------------------------------------

C-Square Code    0
Latitude         0
Longitude        0
Species Count    0
dtype: int64

--------------------------------------------------

Region                  0
Country                 0
State             1450990
City                    0
Month                   0
Day                     0
Year                    0
AvgTemperature          0
dtype: int64

## **Merging Dataframe**

In [11]:
from dataprep.clean import clean_country
import pandas as pd

df = pd.DataFrame({'country': ['American Samoa', 'Canada', 'France']})
df2 = clean_country(df, 'country', output_format='alpha-2')
df2

  0%|                                                                                            | 0/8 [00:00<…

Country Cleaning Report:
	3 values cleaned (100.0%)
Result contains 3 (100.0%) values in the correct format and 0 null values (0.0%)

          country country_clean
0  American Samoa            AS
1          Canada            CA
2          France            FR